boxDistance = 0.8 -- растояние между ящиками в длину/ширину
boxHeight = 0.7 -- растояние между ящиками в высоту
loaderSkin = 27 -- рабочий скин

timerRestartBox = 10 -- для ящиков

SALARY = 4 -- зарплата за доставку одного ящика

JOB_MARKER = { -- расположение маркеров устройства на работу
	{ x = 380.68, y = -2522.97, z = 7.95 },
}

SHIP_POSITIONS = { -- маркера разгрузки
	{ x = 445.93, y = -2503.41, z = 9 },
	{ x = 447.15, y = -2493.86, z = 9 },
	{ x = 446.79, y = -2483.20, z = 9 },
	{ x = 446.80, y = -2472.93, z = 9 },
} 

BOX_POSITIONS = { -- расположение ящиков
	{ x = 402.5, y = -2498, z = 7.3, bl = 5, bw = 5, bh = 3 },
	{ x = 402.5, y = -2493, z = 7.3, bl = 5, bw = 5, bh = 3 },
	{ x = 402.5, y = -2488, z = 7.3, bl = 5, bw = 5, bh = 3 },
}

TABLE_CONTROL = { -- запрещенные действия
	"next_weapon",
	"previous_weapon",
	"fire",
	"jump",
	"crouch",
	"sprint",
	"enter_exit",
	"enter_passenger"
}