Infrastructure = {}
Infrastructure.OBJECT_LIST = {}

Infrastructure.OBJECT_TYPE = {
    -- Производство
    ['oilRefinery']     = "Нефтеперерабатывающий завод (НПЗ)",
    ['farm']            = "Ферма",
    ['port']            = "Порт",
    ['sawmill']         = 'Пилорама',

    -- Хранение
    ['warehouse']       = "Склад",

    -- Реализация
    ['gasStation']      = "АЗС",
    ['restaurant']      = "Ресторан (кафе)",
    ['shop']            = "Магазин",
    ['bar']             = "Бар",
    ['clothes']         = "Одежда",

    ['carService']      = 'Автосервис',
    ['carTuning']       = 'Тюнинг ателье',
    ['carPaint']        = 'Покрасочная',

    -- Организации
    ['hospital']        = "Больница",
    ['office']          = "Организации",

    -- Прочее
    ['build']           = 'Стройка',

}

-- Порт
Infrastructure.OBJECT_LIST['port'] = {
    { name = "Порт Los Santos", position = { x = 2789.886475, y = -2457.079590, z = 13.633151 } },
    { name = "Порт San Fierro", position = { x = -1725.445068, y = -120.009827, z = 3.548919 } },
}

-- Нефтяные базы
Infrastructure.OBJECT_LIST['oilRefinery'] = {
    { name = "Нефтезавод №1", position = { x = -1040.502075, y = -660.549438, z = 32.012604 } },
    { name = "Нефтезавод №2", position = { x = 2511.000000, y = -2088.000000, z = 13.546875 } },
}

-- Пилорама
Infrastructure.OBJECT_LIST['sawmill'] = {
    { name = "Пилорама", position = { x = -763.911194, y = -104.023621, z = 65.698837 } },
    { name = "Пилорама", position = { x = -548.517700, y = -189.287338, z = 78.406250 }},
}

-- Заправки
Infrastructure.OBJECT_LIST['gasStation'] = {
    { name = "АЗС №1", position = { x = -2235.676025, y = -2570.881348, z = 31.921875 } },
    { name = "АЗС №2", position = { x = 665.693970, y = -583.928101, z = 16.335938 } },
    { name = "АЗС №3", position = { x = -1454.392212, y = 1864.908203, z = 32.632812 } },
    { name = "АЗС №4", position = { x = -68.388245, y = -1160.253540, z = 1.750000 } },
    { name = "АЗС №5", position = { x = 1942.227417, y = -1789.583130, z = 13.382812 } },
    { name = "АЗС №6", position = { x = 997.921814, y = -903.437134, z = 42.211765 } },
    { name = "АЗС №7", position = { x = 1408.03, y = 462.00, z = 21.00} },
    { name = "АЗС №8", position = { x = -2018.668457, y = 156.762360, z = 28.125134 } },
    { name = "АЗС №9", position = { x = -1627.035156, y = -2695.908203, z = 48.539062 } },
    { name = "АЗС №10", position = { x = -1706.556519, y = 386.225433, z = 7.187244 } },
    { name = "АЗС №11", position = { x = -2416.248047, y = 960.117188, z = 45.301617 } },
    { name = "АЗС №12", position = { x = -1316.920898, y = 2695.454102, z = 50.062500 } },
    { name = "АЗС №13", position = { x = 637.460205, y = 1686.687744, z = 6.992188 } },
    { name = "АЗС №14", position = { x = 1583.280273, y = 2212.183594, z = 10.820312 } },
    { name = "АЗС №15", position = { x = 2147.835938, y = 2757.923340, z = 10.820312 } },
    { name = "АЗС №16", position = { x = 2202.4775390625, y = 2466.7998046875, z = 10.8203125 } },
    { name = "АЗС №17", position = { x = 2638.070801, y = 1121.008057, z = 10.820312 } },
    { name = "АЗС №18", position = { x = 2117.028809, y = 905.084534, z = 10.820312 } },
    { name = "АЗС №19", position = { x = 438.555603, y = -2438.282227, z = 7.946875 } },
}

-- Фермы
Infrastructure.OBJECT_LIST['farm'] = {
    { name = "Farm Blueberry Acres", position = { x = -35.480667, y = 64.559349, z = 3.117188 } },
    { name = "Farm Flint County", position = { x = -1054.996216, y = -1195.036377, z = 129.090942 } },
    { name = "Farm Flint Range", position = { x = -378.261963, y = -1426.642456, z = 25.726562 } },
    { name = "Farm Hilltop", position = { x = 1058.398560, y = -341.629974, z = 73.992188 } },
    { name = "Farm Leafy Hollow", position = { x = -1108.754761, y = -1620.942139, z = 76.367188 } },
    { name = "Farm Red County", position = { x = 1921.018066, y = 175.509094, z = 37.275230 } },
    { name = "Farm Wheststone", position = { x = -1411.057007, y = -1472.442261, z = 101.647964 } },
}

-- Магазины 
Infrastructure.OBJECT_LIST['shop'] = {
    { name = "24 Seven", position = { x = 2247.562500, y = 2404.962891, z = 10.820312 } },
    { name = "24 Seven", position = { x = 2888.1987304688, y = 2449.3559570313, z = 10.8203125 } },
    { name = "24 Seven", position = { x = 2556.465332, y = 2006.347656, z = 10.815792 } },
    { name = "24 Seven", position = { x = 2097.7663574219, y = 2220.6105957031, z = 10.8203125 } },
    { name = "24 Seven", position = { x = 1933.412964, y = 2306.646240, z = 10.820312 } },
    { name = "24 Seven", position = { x = 2187.292725, y = 1991.806152, z = 10.820312 } },
    { name = "69C", position = { x = 1829.210449, y = -1843.063354, z = 13.578125 } },
    { name = "Robois food mart", position = { x = 1315.305298, y = -872.375061, z = 39.578125 } },
    { name = "Robois food mart", position = { x = 1339.573608, y = -1763.395142, z = 13.529539 } },
}

-- Кафе
Infrastructure.OBJECT_LIST['restaurant'] = {
    { name = "Сafe", position = { x = -195.417175, y = 1214.081177, z = 19.742188 } },
    { name = "Burger Shot", position = { x = 1180.596558, y = -902.536743, z = 43.304173 } },
    { name = "Burger Shot", position = { x = 810.514832, y = -1631.901489, z = 13.390568 } },
    { name = "Burger Shot", position = { x = -2319.652100, y = -150.310730, z = 35.554688 } },
    { name = "Burger Shot", position = { x = -1909.233521, y = 823.055908, z = 35.171875 } },
    { name = "Burger Shot", position = { x = -2342.899902, y = 990.880432, z = 50.702892 } },
    { name = "Burger Shot", position = { x = 1134.752930, y = 2086.690186, z = 11.062500 } },
    { name = "Burger Shot", position = { x = 1890.151978, y = 2087.199463, z = 11.062500 } },
    { name = "Burger Shot", position = { x = 2364.058594, y = 2077.154785, z = 10.820312 } },
    { name = "Burger Shot", position = { x = 2154.105225, y = 2802.197510, z = 10.820312 } },
    { name = "Burger Shot", position = { x = 2455.180908, y = 2019.163086, z = 11.062500 } },
    { name = "Cluckin Bell", position = { x = -2151.626953, y = -2445.360352, z = 30.632761 } },
    { name = "Cluckin Bell", position = { x = 2388.419678, y = -1895.749756, z = 13.382812 } },
    { name = "Cluckin Bell", position = { x = 2422.906250, y = -1499.475342, z = 23.992208 } },
    { name = "Cluckin Bell", position = { x = 925.158997, y = -1364.296021, z = 13.385050 } },
    { name = "Cluckin Bell", position = { x = -1810.974976, y = 615.565613, z = 35.171875 } },
    { name = "Cluckin Bell", position = { x = -2682.927490, y = 262.837494, z = 4.632812 } },
    { name = "Cluckin Bell", position = { x = -1213.182007, y = 1821.164795, z = 41.718750 } },
    { name = "Cluckin Bell", position = { x = 171.223923, y = 1188.179443, z = 14.757812 } },
    { name = "Cluckin Bell", position = { x = 2384.058838, y = 2046.865601, z = 10.820312 } },
    { name = "Cluckin Bell", position = { x = 2842.5930175781, y = 2403.3088378906, z = 10.8203125 } },
    { name = "Diner", position = { x = -44.354660, y = 1191.578003, z = 19.359375 } },
    { name = "Jays Diner", position = { x = -1937.682495, y = 2381.101562, z = 49.492188 } },
    { name = "Jims Ring", position = { x = 1038.238281, y = -1336.239502, z = 13.550261 } },
    { name = "King Ring", position = { x = -144.10331726074, y = 1219.6821289063, z = 19.735198974609 } },
    { name = "Lil Probein", position = { x = -95.704391, y = 1360.156738, z = 10.273438 } },
    { name = "The Welcome Pump", position = { x = 681.639954, y = -441.623077, z = 16.335938 } },
    { name = "TUFF NUT Donuts", position = { x = -2792.658203, y = 789.720276, z = 49.457581 } },
    { name = "The Well Stacked Pizza Co.", position = { x = 1359.343384, y = 251.993378, z = 19.566933 } },
    { name = "The Well Stacked Pizza Co.", position = { x = 203.775513, y = -176.759369, z = 1.578125 } },
    { name = "The Well Stacked Pizza Co.", position = { x = 2094.1276855469, y = -1806.3448486328, z = 13.550287246704 } },
    { name = "The Well Stacked Pizza Co.", position = { x = 2337.080322, y = 79.808067, z = 26.480257 } },
    { name = "The Well Stacked Pizza Co.", position = { x = -1718.090820, y = 1352.110352, z = 7.178402 } },
    { name = "The Well Stacked Pizza Co.", position = { x = 2371.367188, y = 2547.915283, z = 10.820312 } }, 
}

-- Бары/Магазины алкоголя
Infrastructure.OBJECT_LIST['bar'] = {
    { name = "Bar", position = { x = -183.143585, y = 1081.438721, z = 19.742188 } },
    { name = "Ten Green Bottles", position = { x = 2304.382080, y = -1637.810425, z = 14.512707 } },
    { name = "The Smokin Beef Grill", position = { x = -858.703308, y = 1541.956055, z = 22.746342 } },
    { name = "LIQUOR", position = { x = -184.596375, y = 1035.583862, z = 19.742188 } },
    { name = "LIQUOR", position = { x = -2105.854248, y = -2418.181641, z = 30.625000 } },
    { name = "LIQUOR", position = { x = 240.133850, y = -59.602886, z = 1.578125 } },
}

-- Больницы
Infrastructure.OBJECT_LIST['hospital'] = {
    { name = "All Saints General Hospital", position = { x = 1177.802979, y = -1308.654907, z = 13.834679 } },
    { name = "County Central Hospital LS", position = { x = 2033.271606, y = -1434.957153, z = 17.251461 } },
    { name = "County Central Hospital LV", position = { x = 1631.912231, y = 1797.286743, z = 10.820312 } },
    { name = "Crippen Memorial", position = { x = 1223.528564, y = 303.548737, z = 19.567101 } },
    { name = "Medical Center Angel Pine", position = { x = -2200.324219, y = -2292.287598, z = 30.625000 } },
    { name = "Medical Center El Quebrados", position = { x = -1505.195923, y = 2533.835693, z = 55.687500 } },
    { name = "Medical Center Fort Carson", position = { x = -329.782013, y = 1063.094971, z = 19.742188 } },
    { name = "Medical Center San Fierro", position = { x = -2655.026123, y = 626.495728, z = 14.453125 } },
}

-- Магазины одежды
Infrastructure.OBJECT_LIST['clothes'] = {
    { name = 'Aeris', position = { x = 484.42724609375, y = -1534.8023681641, z = 19.358598709106 } },
    { name = 'Binco', position = { x = 2062.641846, y = 2264.738281, z = 10.172995 } },
    { name = 'ZIP', position = { x = -1888.281006, y = 865.535461, z = 35.164078 } },
    { name = 'ZIP', position = { x = 1475.888428, y = -1130.745972, z = 24.078125 } },
    { name = 'Binco', position = { x = 2248.674561, y = -1662.840820, z = 15.469004 } },
}

-- Тюнинг ателье
Infrastructure.OBJECT_LIST['carTuning'] = {
    { name = 'Тюнинг ателье', position = { x = 2381.939209, y = 1032.365356, z = 10.820312 }},
    { name = 'Тюнинг ателье', position = { x = 1047.144897, y = -1030.571655, z = 32.077587 }},
    { name = 'Тюнинг ателье', position = { x = -1929.112183, y = 234.427094, z = 34.409512 }},
    { name = 'Тюнинг ателье', position = { x = -1779.539795, y = 1203.473022, z = 25.125000 }},
}

-- Покрасочная
Infrastructure.OBJECT_LIST['carPaint'] = {
    { name = 'Покрасочная', position = { x = 1961.534668, y = 2155.151611, z = 10.820312 }},
    { name = 'Покрасочная', position = { x = 2074.738037, y = -1826.143921, z = 13.546875 }},
    { name = 'Покрасочная', position = { x = 1018.678711, y = -1032.870728, z = 31.802101 }},
    { name = 'Покрасочная', position = { x = -1896.502441, y = 272.300781, z = 41.046875 }},
    { name = 'Покрасочная', position = { x = -2436.916504, y = 1033.305664, z = 50.390625 }},
    { name = 'Покрасочная', position = { x = 719.666748, y = -471.885162, z = 16.343704 }},
}

-- Автосервис
Infrastructure.OBJECT_LIST['carService'] = {
    { name = 'Автосервис', position = { x = -2471.505615, y = 1076.264648, z = 55.825432 }},
    { name = 'Автосервис', position = { x = -2052.483887, y = 145.654099, z = 28.835938 }},
    { name = 'Автосервис', position = { x = 386.661804, y = -1822.000610, z = 7.835938 }},
    { name = 'Автосервис', position = { x = 165.628891, y = -23.716764, z = 1.578125 }},
    { name = 'Автосервис', position = { x = 2109.743652, y = 941.654602, z = 10.820312 }},
    { name = 'Автосервис', position = { x = 1632.669556, y = 2192.118164, z = 10.820312 }},
}

-- Стройка
Infrastructure.OBJECT_LIST['build'] = {
    { name = 'Стройка', position = { x = 2463.226074, y = 1951.745605, z = 10.381044 }},
    { name = 'Стройка', position = { x = 2695.867432, y = 846.566833, z = 8.737608 }},
}

-- Офисы
Infrastructure.OBJECT_LIST['office'] = {
    { name = 'Налоговая', position = { x = 1519.630737, y = -1046.039673, z = 23.791952 }},
    { name = 'Налоговая', position = { x = 2373.910889, y = 2470.974121, z = 10.820312 }},
}

-- Склады
Infrastructure.OBJECT_LIST['warehouse'] = {

    -- Крупный (LV)
    [1] = { 
        name = "Склад №1", 
        position = {
            { x = 1697.538086, y = 918.256042, z = 10.820312 },
            { x = 1703.447632, y = 998.595215, z = 10.820312 },
            { x = 1703.375854, y = 1039.459473, z = 10.820312 },
            { x = 1641.464233, y = 1069.682617, z = 10.820312 },
            { x = 1601.954224, y = 1069.512939, z = 10.820312 },
        } 
    },

    -- Крупный (LV)
    [2] = { 
        name = "Склад №2", 
        position = {
            { x = 1423.015991, y = 1066.709717, z = 10.476850 },
            { x = 1469.236694, y = 1067.358643, z = 10.261651 },
            { x = 1468.771240, y = 1038.768066, z = 10.222759 },
            { x = 1461.332031, y = 973.423279, z = 10.180269 },
            { x = 1452.338867, y = 975.273438, z = 10.334866 },
            { x = 1424.901733, y = 974.987610, z = 10.310982 },
            { x = 1406.908447, y = 974.739563, z = 10.812977 },
            { x = 1424.119995, y = 929.794800, z = 10.343525 },
            { x = 1452.488892, y = 929.705383, z = 10.350997 },
            { x = 1426.654175, y = 1029.936523, z = 10.172850 },
            { x = 1424.898315, y = 1038.996948, z = 10.319567 },
            { x = 1401.443726, y = 1163.469971, z = 10.820312 },
            { x = 1400.831787, y = 1141.358643, z = 10.820312 },
        }
    },

    -- Крупный (LV)
    [3] = { 
        name = "Склад №3", 
        position = { 
            { x = 1725.102661, y = 730.192566, z = 10.820312 },
            { x = 1724.681274, y = 710.731812, z = 10.820312 },
            { x = 1664.094360, y = 730.567322, z = 10.820312 },
            { x = 1664.616943, y = 709.374573, z = 10.820312 },
            { x = 1607.018921, y = 709.304565, z = 10.820312 },
            { x = 1606.212891, y = 730.713379, z = 10.820312 },
        } 
    },

    -- Средний (LS)
    [4] = { 
        name = "Склад №4", 
        position = { 
            { x = 2155.457031, y = -2291.581299, z = 13.408688 },
            { x = 2160.294922, y = -2281.087158, z = 13.381001 },
            { x = 2168.372314, y = -2275.747559, z = 13.404402 },
            { x = 2174.627441, y = -2267.992432, z = 13.391581 },
        } 
    },

    -- Средний (RC)
    [5] = { 
        name = "Склад №5", 
        position = { 
            { x = -520.360413, y = -500.661072, z = 24.990295 },
            { x = -529.615967, y = -499.955688, z = 25.049236 },
            { x = -557.689880, y = -500.644775, z = 24.999498 },
        }
    },

    -- Средний (LV)
    [6] = { 
        name = "Склад №6", 
        position = { 
            { x = 1076.742798, y = 1892.624512, z = 10.820312 },
            { x = 1091.465698, y = 1890.908447, z = 10.820312 },
            { x = 1082.563477, y = 1915.036377, z = 10.820312 },
            { x = 1060.736084, y = 1915.148193, z = 10.820312 },
            { x = 1109.745850, y = 1925.953369, z = 10.820312 },
            { x = 1109.649902, y = 1904.129639, z = 10.820312 },
            { x = 1133.775391, y = 1935.402466, z = 10.820312 },
        }
    },

    -- Средний (LV)
    [7] = { 
        name = "Склад №7", 
        position = { 
            { x = 1635.437988, y = 2340.324707, z = 10.489252 },
            { x = 1637.295410, y = 2312.655273, z = 10.326208 },
            { x = 1637.958130, y = 2303.345703, z = 10.270833 },
            { x = 1682.616943, y = 2303.102539, z = 10.328024 },
            { x = 1683.520142, y = 2312.177246, z = 10.403494 },
            { x = 1683.831055, y = 2339.910889, z = 10.429473 },
        } 
    },

    -- Средний (LV)
    [8] = { 
        name = "Склад №8", 
        position = { 
            { x = 2261.698730, y = 2748.046143, z = 10.820312 },
            { x = 2261.846436, y = 2770.201172, z = 10.820312 },
            { x = 2294.732178, y = 2754.447998, z = 10.820312 },
            { x = 2294.535400, y = 2769.554199, z = 10.820312 },
            { x = 2312.933838, y = 2738.667725, z = 10.820312 },
            { x = 2313.600342, y = 2754.569824, z = 10.820312 },
            { x = 2345.508301, y = 2769.316406, z = 10.820312 },
            { x = 2399.374756, y = 2755.887451, z = 10.820312 },
            { x = 2366.886475, y = 2755.410156, z = 10.820312 },
            { x = 2399.646729, y = 2800.456787, z = 10.820312 },
        }
    },

    -- Средний (LV)
    [9] = { 
        name = "Склад №9", 
        position = {
            { x = 2842.369873, y = 996.828247, z = 10.750000 },
            { x = 2843.538330, y = 956.791504, z = 10.750000 },
            { x = 2855.270020, y = 898.459900, z = 10.344782 },
            { x = 2827.501953, y = 898.138000, z = 10.317884 },
            { x = 2818.048340, y = 898.588257, z = 10.355507 },
        }
    },

    -- Средний (LS) - кастомный
    [10] = {
        name = "Склад №10",
        position = {
            { x = 2715.452881, y = -2808.203613, z = 13.546875 },
            { x = 2701.372070, y = -2809.126709, z = 13.546875 },
            { x = 2676.365234, y = -2807.296143, z = 13.546875 },
        },
    },

    -- Средний (RC)
    [11] = {
        name = "Склад №11",
        position = {
            { x = 52.266830, y = -286.518005, z = 1.695724 },
            { x = 64.239075, y = -284.520233, z = 1.578125 },
        },
    },

    -- Мелкий (LS)
    [12] = { 
        name = "Склад №12",
        position = {
            { x = -29.184090, y = -1123.820435, z = 1.078125 },
            { x = -31.996122, y = -1133.325806, z = 1.078125 },
            { x = -64.534325, y = -1110.306030, z = 1.078125 },
            { x = -67.552940, y = -1120.321655, z = 1.078125 },
        }
    },

    -- Мелкий (LV)
    [13] = { 
        name = "Склад №13", 
        position = { 
            { x = 1022.215149, y = 2266.558838, z = 10.820312 }, 
        } 
    },

    -- Мелкий (LV)
    [14] = { 
        name = "Склад №14", 
        position = {
            { x = 1476.478271, y = 2369.887451, z = 10.820312 },
            { x = 1494.049072, y = 2367.678711, z = 10.820312 },
            { x = 1516.848511, y = 2369.858643, z = 10.820312 },
        } 
    },

    -- Мелкий (LV)
    [15] = { 
        name = "Склад №15", 
        position = { 
            { x = 1748.605469, y = 2242.600342, z = 10.820312 },
            { x = 1749.289673, y = 2193.468018, z = 10.820312 },
            { x = 1748.225098, y = 2206.346436, z = 10.820312 },
            { x = 1749.090210, y = 2222.280762, z = 10.820312 },
        } 
    },

    -- Мелкий (RC)
    [16] = {
        name = "Склад №16",
        position = {
            { x = 251.415009, y = -218.031662, z = 1.578125 },
            { x = 269.621887, y = -218.378464, z = 1.578125 },
            { x = 293.762024, y = -218.462036, z = 1.578125 },
        },
    },

    -- Мелкий (RC)
    [17] = {
        name = "Склад №17",
        position = {
            { x = 830.416992, y = -611.078857, z = 16.335938 },
            { x = 820.669128, y = -611.121338, z = 16.335938 },
            { x = 789.888916, y = -611.034119, z = 16.335938 },
        },
    },

}

function Infrastructure.getWarehouseDataById(warehouseId)
    if (type(warehouseId) ~= 'number' or not Infrastructure.OBJECT_LIST['warehouse'][warehouseId]) then
        return false
    end
    return Infrastructure.OBJECT_LIST['warehouse'][warehouseId]
end

function Infrastructure.getObjectListByType(objectType)
    if type(objectType) ~= 'string' or not Infrastructure.OBJECT_LIST[objectType] then
        return false
    end
    return Infrastructure.OBJECT_LIST[objectType]
end