boxDistance = 0.8 -- растояние между ящиками в длину/ширину
boxHeight = 0.7 -- растояние между ящиками в высоту
loaderSkin = 27 -- рабочий скин

timerRestartBox = 10 -- для ящиков

SALARY = 4 -- зарплата за доставку одного ящика

LOADER_WORK = {
	-- LS
	[1] = {
		job = { x = 380.68, y = -2522.97, z = 7.95 },
		ship = {
			{ x = 445.93, y = -2503.41, z = 9 },
			{ x = 447.15, y = -2493.86, z = 9 },
			{ x = 446.79, y = -2483.20, z = 9 },
			{ x = 446.80, y = -2472.93, z = 9 },
		},
		box = {
			{ x = 402.5, y = -2498, z = 7.3, bl = 5, bw = 5, bh = 3 },
			{ x = 402.5, y = -2493, z = 7.3, bl = 5, bw = 5, bh = 3 },
			{ x = 402.5, y = -2488, z = 7.3, bl = 5, bw = 5, bh = 3 },
		},
	},
	-- LV
	[2] = {
		job = { x = 1053.18, y = 2100.12, z = 11.08 },
		ship = {
			{ x = 1076.35, y = 2137.03, z = 12 },
			{ x = 1076.07, y = 2127.28, z = 12 },
			{ x = 1075.62, y = 2116.68, z = 12 },
			{ x = 1075.78, y = 2106.31, z = 12 },
		},
		box = {
			{ x = 1056.4, y = 2077.5, z = 10.15, bl = 5, bw = 5, bh = 3 },
			{ x = 1061, y = 2077.5, z = 10.15, bl = 5, bw = 5, bh = 3 },
			{ x = 1066, y = 2077.5, z = 10.15, bl = 5, bw = 5, bh = 3 },
		},
	},
}

TABLE_CONTROL = { -- запрещенные действия
	"next_weapon",
	"previous_weapon",
	"fire",
	"jump",
	"crouch",
	"sprint",
	"enter_exit",
	"enter_passenger"
}